app/controllers/bookers_controller.rb

  def index
    @bookers = Booker.all
---
SELECT "bookers".* FROM "bookers"

  def show
    @booker = Booker.find(params[:id])
---
SELECT  "bookers".* FROM "bookers" WHERE "bookers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @booker = Booker.new
    @bookers = Booker.all
---
SELECT "bookers".* FROM "bookers"

  def create
    booker = Booker.new(booker_params)
    booker.save
    if booker.save
---
INSERT INTO "bookers" ("created_at", "updated_at", "title", "body") VALUES (?, ?, ?, ?)  [["created_at", "2019-01-09 03:05:44.071038"], ["updated_at", "2019-01-09 03:05:44.071038"], ["title", "ss"], ["body", "ddd"]]
INSERT INTO "bookers" ("created_at", "updated_at", "title", "body") VALUES (?, ?, ?, ?)  [["created_at", "2019-01-09 03:08:50.670978"], ["updated_at", "2019-01-09 03:08:50.670978"], ["title", "ss"], ["body", "ddd"]]

  def edit
    @booker = Booker.find(params[:id])
---
SELECT  "bookers".* FROM "bookers" WHERE "bookers"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]

  def update
    booker = Booker.find(params[:id])
    booker.update(booker_params)
---
SELECT  "bookers".* FROM "bookers" WHERE "bookers"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "bookers" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "bookers"."id" = ?  [["title", "トラブル知らずのシステム設計"], ["body", "システム設計の要点を図解で説明してくれます"], ["updated_at", "2019-01-10 06:08:48.339800"], ["id", 35]]

  def destroy
    booker = Booker.find(params[:id])
    booker.destroy
---
SELECT  "bookers".* FROM "bookers" WHERE "bookers"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
DELETE FROM "bookers" WHERE "bookers"."id" = ?  [["id", 30]]